Функция МетодСписанияНаДатуДокумента(Дата) Экспорт
	
	РезультатФункции = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчетнаяПолитикаСрезПоследних.МетодСписанияТМЦ
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Дата,) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РезультатФункции = Выборка.МетодСписанияТМЦ;
	
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции