
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
	МетодСписания = УчетнаяПолитика.МетодСписанияНаДатуДокумента(Дата);
	
	Если Не ЗначениеЗаполнено(МетодСписания) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не установлен метод списания ТМЦ на %1 год. Проведение документа невозможно",
			Формат(Год(Дата), "ЧГ=0"));
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДвиженияПродажиТоваров();

	ДвиженияОстатки(Отказ, МетодСписания);
	

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияОстатки(Отказ, Знач МетодСписания)
	
	// регистр ОстаткиНоменклатуры
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Номенклатура КАК Номенклатура,
	|	ВТ_ТабЧасть.Номенклатура.Представление,
	|	ВТ_ТабЧасть.Количество КАК КоличествоДок,
	|	ОстаткиНоменклатурыОстатки.Партия,
	|	ОстаткиНоменклатурыОстатки.Партия.МоментВремени КАК ПартияМоментВремени,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментВремени, Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_ТабЧасть.Номенклатура
	|			ИЗ
	|				ВТ_ТабЧасть КАК ВТ_ТабЧасть)) КАК ОстаткиНоменклатурыОстатки
	|		ПО ВТ_ТабЧасть.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПартияМоментВремени ##НаправлениеСортировки##
	|ИТОГИ
	|	МАКСИМУМ(КоличествоДок) КАК КоличествоДок,
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Номенклатура";
	
	Если МетодСписания = Перечисления.УчетнаяПолитика.ФИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "##НаправлениеСортировки##", "Возр");
	ИначеЕсли МетодСписания = Перечисления.УчетнаяПолитика.ЛИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "##НаправлениеСортировки##", "Убыв");
	КонецЕсли;
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записать();
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Товары;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		Блокировка.Заблокировать();
	Исключение
    	Сообщить("Ошибка при проведении документа: " + ОписаниеОшибки());
    	//Отказ = Истина;
    КонецПопытки;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
		Пока Выборка.Следующий() Цикл

		Нехватка = Выборка.КоличествоДок - Выборка.КоличествоОстаток;

		Если Нехватка > 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("По %1 не хватает %2, реально в наличии %3", Выборка.НоменклатураПредставление,
				Нехватка, Выборка.КоличествоОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;

		Если Не Отказ Тогда
			ОсталосьСписать = Выборка.КоличествоДок;
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();

			Пока ОсталосьСписать > 0 И ВыборкаДетальныеЗаписи.Следующий() Цикл

				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				Движение.Партия = ВыборкаДетальныеЗаписи.Партия;
				Движение.Количество = Мин(ОсталосьСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
				СуммаСписания = ?(Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток,
					ВыборкаДетальныеЗаписи.СуммаОстаток, ВыборкаДетальныеЗаписи.СуммаОстаток
					/ ВыборкаДетальныеЗаписи.КоличествоОстаток * Движение.Количество);
				Движение.Сумма = СуммаСписания;
				ОсталосьСписать = ОсталосьСписать - Движение.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияПродажиТоваров()

	Движения.ПродажиТоваров.Записывать = Истина;
	Движения.ПродажиТоваров.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура,
	|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
	|	СУММА(РасходнаяНакладнаяТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяУслуги.Номенклатура,
	|	СУММА(РасходнаяНакладнаяУслуги.Количество),
	|	СУММА(РасходнаяНакладнаяУслуги.Сумма)
	|ИЗ
	|	Документ.РасходнаяНакладная.Услуги КАК РасходнаяНакладнаяУслуги
	|ГДЕ
	|	РасходнаяНакладнаяУслуги.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяУслуги.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ПродажиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти